adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <ESP32Servo.h>
#include <Wire.h>
// #include <SPI.h> // SPI not needed in WiFi-only build (NRF24 removed)
// #include <RF24.h> // Radio removed
#include <Adafruit_MPU6050.h>
#include <Adafruit_BME280.h>
#include <TinyGPS++.h> // GPS kept (future altitude fusion & UI fields reference altitude_gps)
// Unused environmental / light / air-quality / ToF sensors removed for WiFi-only controller:
// #include <BH1750.h>
// #include "ScioSense_ENS160.h"
// #include <Adafruit_AHTX0.h>
#include <Adafruit_Sensor.h>
// #include <VL53L0X.h>

// FreeRTOS
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"

// WiFi Credentials
const char *ssid = "Dialog 4G";       // Change this to your WiFi name
const char *password = "0N7NT00ANTQ"; // Change this to your WiFi password

// Web Server
WebServer server(80);

// Component Pins
// NRF24L01 pins removed (radio not used in WiFi build)
// #define NRF_CE_PIN 4
// #define NRF_CSN_PIN 5
#define ESC1_PIN 13 // Front Right (CCW)
#define ESC2_PIN 12 // Back Right (CW)
#define ESC3_PIN 14 // Front Left (CW)
#define ESC4_PIN 27 // Back Left (CCW)
#define BUZZER_PIN 26
#define SDA_PIN 21
#define SCL_PIN 22
#define GUVA_PIN 36
#define GPS_RX_PIN 16
#define BATTERY_PIN 35

// Navigation LED Pins
#define NAV_FRONT_RIGHT_GREEN 32
#define NAV_BACK_RIGHT_GREEN 33
#define NAV_BACK_LEFT_RED 25
#define NAV_FRONT_CENTER_WHITE 17
#define NAV_FRONT_LEFT_RED 2
#define NAV_BACK_CENTER_WHITE 15

// PCA9548A I2C Multiplexer
// #define PCA9548A_ADDR 0x70 // I2C multiplexer not used (ToF sensors removed)

// Control Loop Timing
#define CONTROL_LOOP_FREQUENCY 200                          // Hz (was 100)
#define CONTROL_LOOP_PERIOD (1000 / CONTROL_LOOP_FREQUENCY) // ms

// Motor Limits
#define MOTOR_MIN 1000
#define MOTOR_MAX 2000
#define MOTOR_ARM_VALUE 1000
#define MOTOR_IDLE 1000
#define MOTOR_HOVER_ESTIMATE 1550 // Will be calibrated

// Component Objects
// RF24 radio removed – WiFi dashboard provides control inputs
Servo esc1, esc2, esc3, esc4;
Adafruit_MPU6050 mpu;
Adafruit_BME280 bme;
// Removed unused environmental sensor objects (ENS160, AHT21, BH1750)
TinyGPSPlus gps;

// Removed ToF sensor objects (VL53L0X) – not used in stabilization logic yet

// ================================
// CUSTOM PID CONTROLLER IMPLEMENTATION
// ================================
// Enhanced PID Controller Structure with Advanced Features
struct PIDController
{
    double setpoint;
    double smoothedSetpoint; // For setpoint smoothing
    double input;
    double filteredInput; // For derivative filtering
    double output;
    double kp, ki, kd;
    double lastInput;
    double lastFilteredInput;
    double iTerm;
    double outputMin, outputMax;
    double iTermMin, iTermMax; // Separate integral limits for anti-windup
    unsigned long lastTime;
    bool enabled;

    // Integrator gating & leak
    bool allowIntegral; // External gating flag (e.g. throttle above gate)
    double iTermLeak;   // Leak factor per compute call (fraction of iTerm to bleed off when active)

    // Derivative filtering
    double derivativeAlpha; // Low-pass filter coefficient for derivative

    // Setpoint smoothing
    double setpointAlpha; // Smoothing factor for setpoint changes

    // Anti-windup flags
    bool wasOutputSaturated;

    // Diagnostic variables for web dashboard
    double proportional_term;
    double integral_term;
    double derivative_term;
    bool output_saturated;
    bool integral_saturated;

    void initialize(double p, double i, double d, double minOut, double maxOut)
    {
        kp = p;
        ki = i;
        kd = d;
        outputMin = minOut;
        outputMax = maxOut;

        // Set integral limits to 50% of output range to prevent windup
        double range = outputMax - outputMin;
        iTermMin = outputMin + range * 0.25;
        iTermMax = outputMax - range * 0.25;

        lastInput = 0;
        lastFilteredInput = 0;
        filteredInput = 0;
        iTerm = 0;
        setpoint = 0;
        smoothedSetpoint = 0;
        lastTime = millis();
        enabled = false;
        wasOutputSaturated = false;

        allowIntegral = true;
        iTermLeak = 0.001; // Default very small leak (0.1% per compute)

        // Filter coefficients (higher = more filtering)
        derivativeAlpha = 0.1; // 10% new, 90% old for derivative
        setpointAlpha = 0.05;  // 5% new, 95% old for setpoint smoothing

        // Initialize diagnostic variables
        proportional_term = 0;
        integral_term = 0;
        derivative_term = 0;
        output_saturated = false;
        integral_saturated = false;
    }

    double compute()
    {
        if (!enabled)
            return 0;

        unsigned long now = millis();
        double dt = (double)(now - lastTime) / 1000.0; // Convert to seconds for proper units

        // Only compute if sufficient time has passed (minimum 1ms)
        if (dt < 0.001)
            return output;

        // Setpoint smoothing - gradual transition to new setpoint
        smoothedSetpoint = smoothedSetpoint + setpointAlpha * (setpoint - smoothedSetpoint);

        // Input filtering for derivative term
        filteredInput = filteredInput + derivativeAlpha * (input - filteredInput);

        double error = smoothedSetpoint - input;

        // Proportional term
        proportional_term = kp * error;

        // Integral term handling with gating and leak
        // Only accumulate if integral allowed AND (not saturated OR error driving out of saturation)
        bool shouldAccumulateIntegral = allowIntegral && (!wasOutputSaturated ||
                                                          (wasOutputSaturated && ((error > 0 && output <= outputMin) ||
                                                                                  (error < 0 && output >= outputMax))));

        if (shouldAccumulateIntegral && ki != 0.0)
        {
            iTerm += ki * error * dt;
        }
        else
        {
            // Apply leak when not accumulating to bleed off stored integral (prevents lingering bias)
            if (iTermLeak > 0.0 && iTerm != 0.0)
            {
                double leakFactor = (1.0 - iTermLeak);
                if (leakFactor < 0.0)
                    leakFactor = 0.0;
                if (leakFactor > 1.0)
                    leakFactor = 1.0;
                iTerm *= leakFactor;
            }
        }
        // Clamp integral term to prevent windup
        integral_saturated = false;
        if (iTerm > iTermMax)
        {
            iTerm = iTermMax;
            integral_saturated = true;
        }
        else if (iTerm < iTermMin)
        {
            iTerm = iTermMin;
            integral_saturated = true;
        }
        integral_term = iTerm;

        // Derivative term with filtered input to reduce noise
        double dInput = 0;
        if (dt > 0)
        {
            dInput = (filteredInput - lastFilteredInput) / dt;
        }
        derivative_term = -kd * dInput; // Negative because we want to reduce rate of change

