adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
        // Compute final output
        double rawOutput = proportional_term + integral_term + derivative_term;

        // Output saturation/clamping
        output = rawOutput;
        output_saturated = false;
        if (output > outputMax)
        {
            output = outputMax;
            wasOutputSaturated = true;
            output_saturated = true;
        }
        else if (output < outputMin)
        {
            output = outputMin;
            wasOutputSaturated = true;
            output_saturated = true;
        }
        else
        {
            wasOutputSaturated = false;
        }

        // Remember values for next iteration
        lastInput = input;
        lastFilteredInput = filteredInput;
        lastTime = now;

        return output;
    }

    // Inline diagnostic getters (used by web dashboard)
    double getProportionalTerm() const { return proportional_term; }
    double getIntegralTerm() const { return integral_term; }
    double getDerivativeTerm() const { return derivative_term; }
    bool isOutputSaturated() const { return output_saturated; }
    bool isIntegralSaturated() const { return integral_saturated; }

    void reset()
    {
        iTerm = 0;
        lastInput = input;
        lastFilteredInput = input;
        filteredInput = input;
        smoothedSetpoint = setpoint;
        lastTime = millis();
        wasOutputSaturated = false;
        output_saturated = false;
        integral_saturated = false;
        proportional_term = 0;
        integral_term = 0;
        derivative_term = 0;
    }

    void setTunings(double p, double i, double d)
    {
        // Prevent negative gains
        kp = (p < 0) ? 0 : p;
        ki = (i < 0) ? 0 : i;
        kd = (d < 0) ? 0 : d;
    }

    void setOutputLimits(double min, double max)
    {
        if (min >= max)
            return; // Invalid limits

        outputMin = min;
        outputMax = max;

        // Update integral limits
        double range = outputMax - outputMin;
        iTermMin = outputMin + range * 0.25;
        iTermMax = outputMax - range * 0.25;

        // Clamp current values if needed
        if (iTerm > iTermMax)
            iTerm = iTermMax;
        else if (iTerm < iTermMin)
            iTerm = iTermMin;

        if (output > outputMax)
            output = outputMax;
        else if (output < outputMin)
            output = outputMin;
    }

    void setDerivativeFilter(double alpha)
    {
        derivativeAlpha = constrain(alpha, 0.01, 1.0); // Limit to reasonable range
    }

    void setSetpointSmoothing(double alpha)
    {
        setpointAlpha = constrain(alpha, 0.01, 1.0); // Limit to reasonable range
    }

    void setMode(bool enable)
    {
        if (enable && !enabled)
        {
            reset();
        }
        enabled = enable;
    }

    // (Getters inserted later in struct)
}; // End of PIDController struct

// ================================
// Global RTOS handles & synchronization primitives
// (Were accidentally injected inside PIDController; restored here)
// ================================
TaskHandle_t controlTaskHandle = NULL;
TaskHandle_t sensorTaskHandle = NULL;
TaskHandle_t telemetryTaskHandle = NULL;
SemaphoreHandle_t sensorMutex = NULL;
QueueHandle_t commandQueue = NULL;

// Flight Controller State
enum FlightMode
{
    MODE_DISARMED = 0,
    MODE_ARMED = 1,
    MODE_MANUAL = 2,
    MODE_STABILIZE = 3,
    MODE_ALTITUDE_HOLD = 4,
    MODE_POSITION_HOLD = 5,
    MODE_EMERGENCY = 6
};

struct FlightState
{
    FlightMode mode;
    bool motors_armed;
    bool emergency_stop;
    bool gps_available;
    bool altitude_hold_active;
    float hover_throttle;
    unsigned long last_command_time;
    unsigned long arm_time;
};

// Custom PID Controllers - Using advanced controller from droneFreeRTOS.ino
PIDController rollPID, pitchPID, yawPID, altitudePID;

// PID Parameters (will be tuned) - Enhanced values for better stabilization
struct PIDParams
{
    double roll_kp, roll_ki, roll_kd;
    double pitch_kp, pitch_ki, pitch_kd;
    double yaw_kp, yaw_ki, yaw_kd;
    double altitude_kp, altitude_ki, altitude_kd;
};

// Initialize with enhanced values for better stabilization
PIDParams pidParams = {
    // Roll PID - start at zero for live tuning
    .roll_kp = 0.0,
    .roll_ki = 0.0,
    .roll_kd = 0.0,
    // Pitch PID
    .pitch_kp = 0.0,
    .pitch_ki = 0.0,
    .pitch_kd = 0.0,
    // Yaw PID
    .yaw_kp = 0.0,
    .yaw_ki = 0.0,
    .yaw_kd = 0.0,
    // Altitude PID
    .altitude_kp = 0.0,
    .altitude_ki = 0.0,
    .altitude_kd = 0.0};

// Control Inputs (from WiFi dashboard or NRF24L01)
struct ControlInputs
{
    float throttle; // 0-1 (0 = motor_idle, 1 = motor_max)
    float roll;     // -1 to 1 (left/right)
    float pitch;    // -1 to 1 (forward/backward)
    float yaw;      // -1 to 1 (rotate left/right)
    bool arm_switch;
    bool mode_switch;
    unsigned long timestamp;
};

// Sensor Data Structure
struct SensorData
{
    // IMU Data
    float roll_angle;
    float pitch_angle;
    float yaw_angle;
    float roll_rate;
    float pitch_rate;
    float yaw_rate;
    float accel_x, accel_y, accel_z;

    // Altitude Data
    float altitude_baro;
    float altitude_gps;
    float altitude_filtered;
    float vertical_velocity;

    // Position Data (GPS)
    double latitude;
    double longitude;
    float ground_speed;
    int satellites;

    // Environmental
    float temperature;
    float humidity;
    float pressure;
    float air_quality_index;

    // Battery
    float battery_voltage;
    float battery_percentage;

    // System
    unsigned long timestamp;
    bool valid;
};

// IMU calibration data (static constants populated from external calibration sketch)
// Angle offsets are the mounting roll/pitch (deg). Accel offsets are sensor-frame biases (m/s^2) with gravity removed from Z.
// Gyro offsets are raw sensor-frame biases in rad/s (Adafruit library returns rad/s).
const float IMU_ROLL_OFFSET_DEG = 0.246672f;   // mounting roll (deg)
const float IMU_PITCH_OFFSET_DEG = -0.217158f; // mounting pitch (deg)
const float IMU_ACCEL_X_OFFSET = 0.039720f;    // sensor X accel bias (m/s^2)
const float IMU_ACCEL_Y_OFFSET = 0.045119f;    // sensor Y accel bias (m/s^2)
const float IMU_ACCEL_Z_OFFSET = 0.669787f;    // sensor Z accel bias (after gravity removal) (m/s^2)
const float IMU_GYRO_X_OFFSET = 0.101496f;     // sensor X gyro bias (rad/s)
const float IMU_GYRO_Y_OFFSET = 0.010270f;     // sensor Y gyro bias (rad/s)
const float IMU_GYRO_Z_OFFSET = 0.046227f;     // sensor Z gyro bias (rad/s)

// Global State Variables
FlightState flightState;
ControlInputs controlInputs;
SensorData sensorData;

// Motor outputs (PWM values)
struct MotorOutputs
{
    int motor1; // Front Right (CCW)
    int motor2; // Back Right (CW)
    int motor3; // Front Left (CW)
    int motor4; // Back Left (CCW)
};

// Debug Information Structure for Web Dashboard
struct DebugData
{
    // Status Section
    String flight_mode;
    bool armed;
    float throttle_input;
    int throttle_pwm;
    float roll_angle;
    float pitch_angle;
    float yaw_rate;
    float altitude;
    float battery_voltage;

    // PID Debug Section - Enhanced with custom PID diagnostics
    bool pid_active;
    bool pid_enabled_by_throttle;
    float roll_output;
    float pitch_output;
    float yaw_output;
    float roll_setpoint;
    float pitch_setpoint;
    float yaw_setpoint;

    // Advanced PID Diagnostics
    float roll_proportional;
    float roll_integral;
    float roll_derivative;
    bool roll_output_saturated;
    bool roll_integral_saturated;

    float pitch_proportional;
    float pitch_integral;
    float pitch_derivative;
    bool pitch_output_saturated;
    bool pitch_integral_saturated;

