adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
                debugData.yaw_proportional = yawPID.getProportionalTerm();
                debugData.yaw_integral = yawPID.getIntegralTerm();
                debugData.yaw_derivative = yawPID.getDerivativeTerm();
                debugData.yaw_output_saturated = yawPID.isOutputSaturated();
                debugData.yaw_integral_saturated = yawPID.isIntegralSaturated();
                debugData.pitch_output_saturated = pitchPID.isOutputSaturated();
                debugData.pitch_integral_saturated = pitchPID.isIntegralSaturated();

                debugData.yaw_proportional = yawPID.getProportionalTerm();
                debugData.yaw_integral = yawPID.getIntegralTerm();
                debugData.yaw_derivative = yawPID.getDerivativeTerm();
                debugData.yaw_output_saturated = yawPID.isOutputSaturated();
                debugData.yaw_integral_saturated = yawPID.isIntegralSaturated();

                // Calibration Debug Section
                debugData.imu_cal_active = true; // always true now
                debugData.roll_cal_offset = IMU_ROLL_OFFSET_DEG;
                debugData.pitch_cal_offset = IMU_PITCH_OFFSET_DEG;
                debugData.imu_calibrated = true;

                // Motor Mix Section
                debugData.base_pwm = debugData.throttle_pwm;
                debugData.motor1_final = motorOutputs.motor1;
                debugData.motor2_final = motorOutputs.motor2;
                debugData.motor3_final = motorOutputs.motor3;
                debugData.motor4_final = motorOutputs.motor4;
                debugData.motor1_offset = motorCal.motor1_offset;
                debugData.motor2_offset = motorCal.motor2_offset;
                debugData.motor3_offset = motorCal.motor3_offset;
                debugData.motor4_offset = motorCal.motor4_offset;

                // Inputs Section
                debugData.roll_input = controlInputs.roll;
                debugData.pitch_input = controlInputs.pitch;
                debugData.yaw_input = controlInputs.yaw;

                // System Section
                debugData.sensors_ok = sensorData.valid;
                debugData.emergency_active = flightState.emergency_stop;
                debugData.imu_calibrated = true;
                debugData.uptime = millis();
                debugData.free_heap = ESP.getFreeHeap();
                debugData.timestamp = millis();

                xSemaphoreGive(sensorMutex);
            }
        }

        // Only run control loops if armed and not in emergency
        if (flightState.motors_armed)
        {
            if (flightState.mode == MODE_MANUAL)
            {
                // Manual mode - use unified mixer (handles base throttle, inputs, scaling, and offsets)
                mixMotorOutputs();
                outputMotorCommands();
            }
            else if (flightState.mode >= MODE_STABILIZE)
            {
                // Get latest sensor data (thread-safe)
                if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(5)) == pdTRUE)
                {
                    // Copy sensor data to PID controller inputs
                    rollPID.input = sensorData.roll_angle;
                    pitchPID.input = sensorData.pitch_angle;
                    yawPID.input = sensorData.yaw_rate;
                    altitudePID.input = sensorData.altitude_filtered;

                    xSemaphoreGive(sensorMutex);

                    // Run PID controllers
                    runPIDControllers();

                    // Mix motor outputs
                    mixMotorOutputs();

                    // Output to motors
                    outputMotorCommands();
                }
            }
        }
        else
        {
            // Motors disarmed - ensure all motors at idle
            motorOutputs.motor1 = MOTOR_ARM_VALUE;
            motorOutputs.motor2 = MOTOR_ARM_VALUE;
            motorOutputs.motor3 = MOTOR_ARM_VALUE;
            motorOutputs.motor4 = MOTOR_ARM_VALUE;
            outputMotorCommands();
        }
    }
}

void sensorTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(5); // 200Hz sensor reading

    Serial.println("Sensor Task started - Running at 200Hz");

    while (true)
    {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Update all sensor readings
        updateSensors();

        // Calculate orientation from IMU
        calculateOrientation();

        // Update timestamp
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(2)) == pdTRUE)
        {
            sensorData.timestamp = millis();
            sensorData.valid = true;
            xSemaphoreGive(sensorMutex);
        }
    }
}

void telemetryTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(100); // 10Hz telemetry

    Serial.println("Telemetry Task started - Running at 10Hz");

    // Wait a few seconds before first status print
    vTaskDelay(pdMS_TO_TICKS(3000));
    Serial.println("=== FLIGHT CONTROLLER READY ===");
    Serial.printf("Web Dashboard: http://%s\n", WiFi.localIP().toString().c_str());
    Serial.println("Waiting for commands via web interface...");

    while (true)
    {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Handle web server and telemetry
        // This will be expanded for NRF24L01 later

        // Print debug info every 5 seconds (reduce frequency further)
        static int counter = 0;
        if (++counter >= 50) // 5 seconds at 10Hz
        {
            counter = 0;

            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(5)) == pdTRUE)
            {
                // Only print if we have valid sensor data
                if (sensorData.timestamp > 0)
                {
                    Serial.printf("Status - Mode: %d, Armed: %s, Roll: %.1f°, Pitch: %.1f°, Alt: %.1fm, Batt: %.1fV\n",
                                  flightState.mode,
                                  flightState.motors_armed ? "YES" : "NO",
                                  sensorData.roll_angle,
                                  sensorData.pitch_angle,
                                  sensorData.altitude_filtered,
                                  sensorData.battery_voltage);
                }
                xSemaphoreGive(sensorMutex);
            }
        }
    }
}

