adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
// ================================
// CORE FLIGHT CONTROL FUNCTIONS
// ================================

void updateSensors()
{
    static unsigned long lastBME280Read = 0;
    static unsigned long lastGPSRead = 0;
    static unsigned long lastBatteryRead = 0;

    // Read IMU data (high frequency)
    sensors_event_t accel, gyro, temp;
    bool imu_success = mpu.getEvent(&accel, &gyro, &temp);

    if (imu_success && xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        // Board physically rotated 90° CW about Z (looking down). Mapping:
        // bodyX (forward)   = sensorY
        // bodyY (right)     = -sensorX
        // bodyZ (up)        = sensorZ
        // roll (about X)    = gyro Y
        // pitch (about Y)   = -gyro X
        // yaw (about Z)     = gyro Z
        sensorData.accel_x = accel.acceleration.y;
        sensorData.accel_y = -accel.acceleration.x;
        sensorData.accel_z = accel.acceleration.z;
        sensorData.roll_rate = gyro.gyro.y * 180.0 / PI;
        sensorData.pitch_rate = -gyro.gyro.x * 180.0 / PI;
        sensorData.yaw_rate = gyro.gyro.z * 180.0 / PI;
        xSemaphoreGive(sensorMutex);
    }

    // Read BME280 (lower frequency)
    if (millis() - lastBME280Read > 50)
    { // 20Hz
        lastBME280Read = millis();

        float pressure = bme.readPressure();
        if (!isnan(pressure) && pressure > 0)
        {
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                sensorData.pressure = pressure / 100.0;               // Convert to hPa
                sensorData.altitude_baro = bme.readAltitude(1013.25); // Sea level pressure
                sensorData.temperature = bme.readTemperature();
                sensorData.humidity = bme.readHumidity();
                xSemaphoreGive(sensorMutex);
            }
        }
    }

    // GPS reading disabled for now to prevent errors
    /*
    // Read GPS (lower frequency)
    if (millis() - lastGPSRead > 100)
    { // 10Hz
        lastGPSRead = millis();
        // GPS code commented out until Serial2 is properly initialized
    }
    */

    // Read battery (very low frequency)
    if (millis() - lastBatteryRead > 1000)
    { // 1Hz
        lastBatteryRead = millis();

        int rawValue = analogRead(BATTERY_PIN);
        float vOut = (rawValue / 4095.0) * 3.3;

        // For 3S LiPo battery reading - adjust voltage divider ratio
        // If no voltage divider is used, multiply by appropriate factor
        // Common voltage divider: R1=10k, R2=10k (divide by 2) = vOut * 2
        // For 3S LiPo (12.6V max): need divide by ~4, so vOut * 4
        // Empirical correction: 3.4V reading suggests vOut * 3.7 for 12.6V
        float batteryVoltage = vOut * 3.7; // Adjusted for actual hardware setup

        // Debug battery reading every 10 seconds
        static int battery_debug_counter = 0;
        if (++battery_debug_counter >= 10)
        {
            battery_debug_counter = 0;
            Serial.printf("Battery Debug - Raw ADC: %d, vOut: %.2f, Final: %.2f\n", rawValue, vOut, batteryVoltage);
        }

        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
        {
            sensorData.battery_voltage = batteryVoltage;
            // Calculate percentage (3S LiPo: 9.0V-12.6V) - display only
            sensorData.battery_percentage = ((batteryVoltage - 9.0) / (12.6 - 9.0)) * 100.0;
            sensorData.battery_percentage = constrainFloat(sensorData.battery_percentage, 0.0, 100.0);
            xSemaphoreGive(sensorMutex);
        }
    }
}

void calculateOrientation()
{
    static float roll_angle = 0.0;
    static float pitch_angle = 0.0;
    static unsigned long lastUpdate = 0;

    unsigned long now = millis();
    float dt = (now - lastUpdate) / 1000.0; // Convert to seconds
    lastUpdate = now;

    if (dt > 0.1)
        dt = 0.1; // Limit dt to prevent large jumps

    // Get current sensor readings (thread-safe)
    float accel_x, accel_y, accel_z;
    float gyro_roll, gyro_pitch;

    if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        accel_x = sensorData.accel_x;
        accel_y = sensorData.accel_y;
        accel_z = sensorData.accel_z;
        gyro_roll = sensorData.roll_rate;
        gyro_pitch = sensorData.pitch_rate;
        xSemaphoreGive(sensorMutex);
    }
    else
    {
        return; // Skip this update if we can't get sensor data
    }

    // Apply IMU calibration offsets (note: sensor physically rotated 90° CW about Z)
    // Stored offsets are in raw sensor frame (sensorX, sensorY, sensorZ).
    // Mapping applied earlier: bodyX = sensorY, bodyY = -sensorX, bodyZ = sensorZ
    // Accelerometer: transform offsets into body frame before subtraction
    float body_accel_x_offset = IMU_ACCEL_Y_OFFSET;  // bodyX uses sensorY
    float body_accel_y_offset = -IMU_ACCEL_X_OFFSET; // bodyY uses -sensorX
    float body_accel_z_offset = IMU_ACCEL_Z_OFFSET;  // unchanged
    accel_x -= body_accel_x_offset;
    accel_y -= body_accel_y_offset;
    accel_z -= body_accel_z_offset;

    // Gyroscope: body roll rate from sensorY, body pitch rate from -sensorX
    float body_gyro_roll_offset_deg = IMU_GYRO_Y_OFFSET * 180.0 / PI;   // sensorY -> roll
    float body_gyro_pitch_offset_deg = -IMU_GYRO_X_OFFSET * 180.0 / PI; // -sensorX -> pitch
    gyro_roll -= body_gyro_roll_offset_deg;
    gyro_pitch -= body_gyro_pitch_offset_deg;

    // Calculate angles from accelerometer
    // Fix roll axis to match physical tilt direction
    // Remove leading negative to align roll angle sign with control input (previous sign caused inverted response)
    // After 90° CW rotation about Z: bodyX=sensorY, bodyY=-sensorX.
    // Keep roll = tilt about bodyX, pitch = tilt about bodyY (standard aerospace).
    // Use transformed accel_x/accel_y that already represent body axes.
    float accel_roll = atan2(accel_y, sqrt(accel_x * accel_x + accel_z * accel_z)) * 180.0 / PI;   // roll from bodyY
    float accel_pitch = atan2(-accel_x, sqrt(accel_y * accel_y + accel_z * accel_z)) * 180.0 / PI; // pitch from bodyX
    // Subtract mounting angle offsets so a physically level frame reads near 0/0
    accel_roll -= IMU_ROLL_OFFSET_DEG;
    accel_pitch -= IMU_PITCH_OFFSET_DEG;

