adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    // Apply calibration offsets to get relative angles from level position
    // Do not subtract additional angle offsets here; accelerometer biases are already
    // compensated above. Additional angle offset subtraction would double-correct and
    // introduce a residual bias when level. The complementary filter is seeded after
    // calibration to ensure the fused attitude starts at level.

    // Initialize on first use or on calibration edge
    if (!kalmanRoll.initialized)
    {
        kalmanRoll.x = accel_roll;
        kalmanRoll.p = 4.0f;
        kalmanRoll.initialized = true;
        kalmanPitch.x = accel_pitch;
        kalmanPitch.p = 4.0f;
        kalmanPitch.initialized = true;
    }
    // Prediction
    float q = (KALMAN_RATE_STD * KALMAN_RATE_STD) * dt; // process noise variance contribution
    kalmanRoll.x += gyro_roll * dt;
    kalmanRoll.p += q;
    kalmanPitch.x += gyro_pitch * dt;
    kalmanPitch.p += q;
    // Measurement update
    float r = (KALMAN_MEAS_STD * KALMAN_MEAS_STD);
    float k_r = kalmanRoll.p / (kalmanRoll.p + r);
    float k_p = kalmanPitch.p / (kalmanPitch.p + r);
    kalmanRoll.x += k_r * (accel_roll - kalmanRoll.x);
    kalmanRoll.p *= (1.0f - k_r);
    kalmanPitch.x += k_p * (accel_pitch - kalmanPitch.x);
    kalmanPitch.p *= (1.0f - k_p);
    roll_angle = kalmanRoll.x;
    pitch_angle = kalmanPitch.x;

    // Update global sensor data
    if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        sensorData.roll_angle = roll_angle;
        sensorData.pitch_angle = pitch_angle;

        // Simple altitude filtering (combine GPS and barometric)
        if (flightState.gps_available && sensorData.satellites >= 4)
        {
            // Use GPS altitude when available and reliable
            sensorData.altitude_filtered = sensorData.altitude_gps;
        }
        else
        {
            // Fall back to barometric altitude
            sensorData.altitude_filtered = sensorData.altitude_baro;
        }

        xSemaphoreGive(sensorMutex);
    }
}

void runPIDControllers()
{
    // Unified with RF controller logic: MANUAL mode passes raw sticks to mixer; STABILIZE enables angle/yaw rate PIDs.
    // Mixer gains have been reduced to 100/100/75 to match droneFreeRTOS.ino for consistent tuning behavior.
    // Time delta for slew limiting
    unsigned long nowMs = millis();
    float dt = (prevSlewTimeMs == 0) ? 0.01f : (float)(nowMs - prevSlewTimeMs) / 1000.0f;
    if (dt <= 0)
        dt = 0.01f; // fallback
    prevSlewTimeMs = nowMs;

    // Raw desired commands from sticks (pre-slew)
    // Invert roll stick here to compensate for previous sensor sign convention change
    float desiredRollDeg = (controlInputs.roll) * 30.0f; // +/-30°
    // Invert pitch: positive input should command nose-up (increase rear motor thrust)
    float desiredPitchDeg = -controlInputs.pitch * 30.0f; // +/-30° (inverted)
    float desiredYawRate = controlInputs.yaw * 180.0f;    // +/-180°/s (rate)

    // Apply calibration reference if IMU calibrated (angles already relative in sensorData)
    // Slew limit roll/pitch setpoints
    float maxDeltaRP = slewRateRP * dt; // deg change allowed this cycle
    float deltaR = desiredRollDeg - prevRollSetpointCmd;
    if (deltaR > maxDeltaRP)
        deltaR = maxDeltaRP;
    if (deltaR < -maxDeltaRP)
        deltaR = -maxDeltaRP;
    prevRollSetpointCmd += deltaR;

    float deltaP = desiredPitchDeg - prevPitchSetpointCmd;
    if (deltaP > maxDeltaRP)
        deltaP = maxDeltaRP;
    if (deltaP < -maxDeltaRP)
        deltaP = -maxDeltaRP;
    prevPitchSetpointCmd += deltaP;

    // Yaw slew limiting (rate command smoothing)
    float maxDeltaYaw = slewRateYaw * dt; // deg/s change allowed
    float deltaY = desiredYawRate - prevYawRateCmd;
    if (deltaY > maxDeltaYaw)
        deltaY = maxDeltaYaw;
    if (deltaY < -maxDeltaYaw)
        deltaY = -maxDeltaYaw;
    prevYawRateCmd += deltaY;

    if (flightState.mode >= MODE_STABILIZE)
    {
        if (!USE_CASCADED_ANGLE_RATE)
        {
            // Direct angle stabilization (existing behavior)
            rollPID.setpoint = prevRollSetpointCmd;
            pitchPID.setpoint = prevPitchSetpointCmd;
        }
        else
        {
            // Outer angle loop will compute desired rates; set setpoints for rate PIDs later
            rollPID.setpoint = prevRollSetpointCmd;
            pitchPID.setpoint = prevPitchSetpointCmd;
        }
        yawPID.setpoint = prevYawRateCmd; // yaw stays a rate setpoint
    }

    // Altitude hold setpoint maintenance handled elsewhere

    // Throttle gate now only gates integral accumulation; P/D remain active so sliders respond at any throttle
    bool aboveGate = controlInputs.throttle > throttleGate;
    rollPID.allowIntegral = aboveGate;
    pitchPID.allowIntegral = aboveGate;
    yawPID.allowIntegral = aboveGate;

    if (flightState.mode >= MODE_STABILIZE)
    {
        if (!USE_CASCADED_ANGLE_RATE)
        {
            // Original direct angle control path
            rollPID.setMode(true);
            pitchPID.setMode(true);
            yawPID.setMode(true);

            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                rollPID.input = sensorData.roll_angle;
                pitchPID.input = sensorData.pitch_angle;
                yawPID.input = sensorData.yaw_rate;
                xSemaphoreGive(sensorMutex);
            }

            rollPID.compute();
            pitchPID.compute();
            yawPID.compute();
        }
        else
        {
            // Cascaded angle->rate: outer angle PIDs produce desired rates; inner PIDs track actual rates
            rollPID.setMode(true);
            pitchPID.setMode(true);
            yawPID.setMode(true); // yaw still direct rate
            rollRatePID.setMode(true);
            pitchRatePID.setMode(true);

            float rollAngle, pitchAngle, rollRate, pitchRate, yawRate;
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                rollAngle = sensorData.roll_angle;
                pitchAngle = sensorData.pitch_angle;
                rollRate = sensorData.roll_rate;
                pitchRate = sensorData.pitch_rate;
                yawRate = sensorData.yaw_rate;
                xSemaphoreGive(sensorMutex);
            }
            else
            {
                // Fallback to last known inputs in controllers
                rollAngle = rollPID.input;
                pitchAngle = pitchPID.input;
                rollRate = 0;
                pitchRate = 0;
                yawRate = 0;
            }

            rollPID.input = rollAngle;
            pitchPID.input = pitchAngle;
            yawPID.input = yawRate;

