adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
            // Outer angle compute to get desired rate commands

            // Outer angle compute to get desired rate commands
            double rollDesiredRate = constrainFloat((float)rollPID.compute(), -MAX_ROLL_PITCH_RATE, MAX_ROLL_PITCH_RATE);
            double pitchDesiredRate = constrainFloat((float)pitchPID.compute(), -MAX_ROLL_PITCH_RATE, MAX_ROLL_PITCH_RATE);

            // Inner rate loop setpoints and inputs
            rollRatePID.setpoint = rollDesiredRate;
            pitchRatePID.setpoint = pitchDesiredRate;
            rollRatePID.input = rollRate;
            pitchRatePID.input = pitchRate;

            rollRatePID.allowIntegral = aboveGate;
            pitchRatePID.allowIntegral = aboveGate;
            rollRatePID.compute();
            pitchRatePID.compute();

            // Map inner loop outputs into original roll/pitch PID outputs for mixer
            rollPID.output = rollRatePID.output;
            pitchPID.output = pitchRatePID.output;
            // Yaw direct
            yawPID.compute();
        }

        // Yaw feed-forward always applies
        if (yawFeedForward != 0.0f)
        {
            double ff = yawFeedForward * yawPID.setpoint; // setpoint in deg/s
            yawPID.output += ff;
            if (yawPID.output > yawPID.outputMax)
                yawPID.output = yawPID.outputMax;
            if (yawPID.output < yawPID.outputMin)
                yawPID.output = yawPID.outputMin;
        }
    }
    else
    {
        rollPID.setMode(false);
        pitchPID.setMode(false);
        yawPID.setMode(false);
        rollPID.output = 0.0;
        pitchPID.output = 0.0;
        yawPID.output = 0.0;
    }

    if (flightState.altitude_hold_active)
    {
        altitudePID.setMode(true);
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
        {
            altitudePID.input = sensorData.altitude_filtered;
            xSemaphoreGive(sensorMutex);
        }
        altitudePID.compute();
    }
}

void mixMotorOutputs()
{
    // 1. Determine base throttle with dynamic headroom (align with droneFreeRTOS behavior)
    // controlInputs.throttle expected 0..1
    float throttleInputNorm = constrainFloat(controlInputs.throttle, 0.0f, 1.0f);

    float baseMicros;
    if (flightState.mode == MODE_MANUAL)
    {
        // Manual: give full usable range (idle..max) directly
        baseMicros = mapFloat(throttleInputNorm, 0.0f, 1.0f, MOTOR_IDLE, MOTOR_MAX);
    }
    else
    {
        // Option B: NO pre-reserved headroom. Use full user throttle range (idle..max) for base.
        // Differential authority is then dynamically scaled inside applyScaledMotorMix.
        baseMicros = mapFloat(throttleInputNorm, 0.0f, 1.0f, MOTOR_IDLE, MOTOR_MAX);

        // Altitude hold additive correction (only if active) applied on top of full-range base.
        if (flightState.altitude_hold_active)
        {
            const float ALT_CORR_MAX = 300.0f;                          // ±300 µs window
            float centeredAlt = (altitudePID.output - 500.0f) / 500.0f; // altitudePID 0..1000 -> -1..+1
            centeredAlt = constrainFloat(centeredAlt, -1.0f, 1.0f);
            baseMicros += centeredAlt * ALT_CORR_MAX;
        }
        // Clamp base after altitude adjustment
        if (baseMicros < MOTOR_IDLE)
            baseMicros = MOTOR_IDLE;
        if (baseMicros > MOTOR_MAX)
            baseMicros = MOTOR_MAX;
    }

    // 2. Prepare control axes (manual inputs or PID outputs depending on mode)
    float Rn = 0.0f, Pn = 0.0f, Yn = 0.0f;
    if (flightState.mode == MODE_MANUAL)
    {
        // Manual: use stick inputs directly normalized (already -1..1 expected)
        // Roll sign: positive roll input tilts right; left roll increases right-side motors
        Rn = constrainFloat((controlInputs.roll) * manualAxisGain, -1.0f, 1.0f);
        // Invert pitch normalization so positive stick increases back motor thrust (nose-up)
        Pn = -constrainFloat(controlInputs.pitch * manualAxisGain, -1.0f, 1.0f);
        Yn = constrainFloat(controlInputs.yaw * manualAxisGain, -1.0f, 1.0f);
    }
    else
    {
        // Stabilized modes: use PID outputs normalized by gains
        Rn = constrainFloat((float)(rollPID.output / MIX_KR), -1.0f, 1.0f);
        Pn = constrainFloat((float)(pitchPID.output / MIX_KP), -1.0f, 1.0f);
        Yn = constrainFloat((float)(yawPID.output / MIX_KY), -1.0f, 1.0f);
    }

    // 3. Apply unified scaled mixing (handles saturation headroom automatically)
    applyScaledMotorMix(baseMicros, Rn, Pn, Yn);

    // 4. Apply motor calibration offsets AFTER mixing (applies to all modes).
    // Manual mode already applies offsets in the manual path; stabilized uses this path via mixMotorOutputs.
    motorOutputs.motor1 = constrain(motorOutputs.motor1 + (int)motorCal.motor1_offset, MOTOR_MIN, MOTOR_MAX);
    motorOutputs.motor2 = constrain(motorOutputs.motor2 + (int)motorCal.motor2_offset, MOTOR_MIN, MOTOR_MAX);
    motorOutputs.motor3 = constrain(motorOutputs.motor3 + (int)motorCal.motor3_offset, MOTOR_MIN, MOTOR_MAX);
    motorOutputs.motor4 = constrain(motorOutputs.motor4 + (int)motorCal.motor4_offset, MOTOR_MIN, MOTOR_MAX);
}

void outputMotorCommands()
{
    // Output PWM commands to ESCs
    esc1.writeMicroseconds(motorOutputs.motor1);
    esc2.writeMicroseconds(motorOutputs.motor2);
    esc3.writeMicroseconds(motorOutputs.motor3);
    esc4.writeMicroseconds(motorOutputs.motor4);
}

void checkSafetyConditions()
{
    // Check for emergency conditions
    unsigned long now = millis();

    // Initialize battery voltage properly to avoid false alarms
    static bool battery_initialized = false;
    if (!battery_initialized && sensorData.battery_voltage > 9.0)
    {
        battery_initialized = true;
    }

    // Only check command timeout if motors are armed and we've received commands
    // Command timeout temporarily disabled for testing
    // TODO: Re-enable command timeout once web interface sends continuous heartbeat
    // if (flightState.motors_armed && controlInputs.timestamp > 0 && (now - controlInputs.timestamp > 5000))
    // { // 5 second timeout only when armed
    //     flightState.emergency_stop = true;
    //     Serial.println("EMERGENCY: Command timeout!");
    // }

    // Battery safety check disabled - display only
    // TODO: Fix battery voltage reading hardware/software issue
    // if (flightState.motors_armed && battery_initialized && sensorData.battery_voltage > 9.0 && sensorData.battery_percentage < 10.0)
    // {
    //     flightState.emergency_stop = true;
    //     Serial.println("EMERGENCY: Critical battery voltage!");
    // }

    // Check for sensor failures - only if sensors have been initialized and motors are armed
    if (flightState.motors_armed && sensorData.timestamp > 0 && (now - sensorData.timestamp > 500))
    { // 500ms sensor timeout only when armed
        flightState.emergency_stop = true;
        Serial.println("EMERGENCY: Sensor data timeout!");
    }

