adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    // Check for excessive tilt angles - only when armed
    if (flightState.motors_armed && (abs(sensorData.roll_angle) > 60.0 || abs(sensorData.pitch_angle) > 60.0))
    {
        flightState.emergency_stop = true;
        Serial.println("EMERGENCY: Excessive tilt angle!");
    }
}

void handleEmergency()
{
    // Emergency procedure: gradually reduce throttle
    static int emergency_throttle = MOTOR_IDLE;
    static unsigned long last_emergency_update = 0;

    unsigned long now = millis();
    if (now - last_emergency_update > 50)
    { // Update every 50ms
        last_emergency_update = now;

        if (emergency_throttle > MOTOR_ARM_VALUE)
        {
            emergency_throttle -= 5; // Gradually reduce
        }

        // Set all motors to emergency throttle
        motorOutputs.motor1 = emergency_throttle;
        motorOutputs.motor2 = emergency_throttle;
        motorOutputs.motor3 = emergency_throttle;
        motorOutputs.motor4 = emergency_throttle;

        outputMotorCommands();

        // Flash red navigation LEDs during emergency
        static bool led_state = false;
        led_state = !led_state;
        digitalWrite(NAV_BACK_LEFT_RED, led_state);
        digitalWrite(NAV_FRONT_LEFT_RED, led_state);
    }
}

void updateFlightMode()
{
    // Edge-detected arming & mode toggling unified with RF build semantics.
    // arm_switch: momentary or latched; we treat rising edge (false->true) as ARMED, falling as DISARM.
    // mode_switch: while armed, changes flight mode: false = MANUAL, true = STABILIZE.
    static bool lastArmSwitch = false;
    static bool lastModeSwitch = false;

    bool armEdgeRising = (!lastArmSwitch && controlInputs.arm_switch);
    bool armEdgeFalling = (lastArmSwitch && !controlInputs.arm_switch);
    lastArmSwitch = controlInputs.arm_switch;

    // Handle arming on rising edge
    if (armEdgeRising && !flightState.motors_armed)
    {
        bool throttle_ok = (controlInputs.throttle < 0.05f); // require near-zero throttle
        bool level_ok = true;
        if (sensorData.timestamp > 0 && sensorData.valid)
        {
            level_ok = (fabs(sensorData.roll_angle) < 30.0f && fabs(sensorData.pitch_angle) < 30.0f);
        }
        if (throttle_ok && level_ok)
        {
            flightState.motors_armed = true;
            flightState.arm_time = millis();
            flightState.emergency_stop = false;
            // Determine initial mode from current mode_switch state
            flightState.mode = controlInputs.mode_switch ? MODE_STABILIZE : MODE_MANUAL;
            lastModeSwitch = controlInputs.mode_switch; // seed edge detector
            Serial.printf("🔓 ARMED - %s MODE\n", flightState.mode == MODE_STABILIZE ? "STABILIZE" : "MANUAL");
            // Simple feedback (non-blocking style minimal delays preserved)
            digitalWrite(BUZZER_PIN, HIGH);
            delay(120);
            digitalWrite(BUZZER_PIN, LOW);
        }
        else
        {
            Serial.printf("ARM BLOCKED (thr %.2f, level %s)\n", controlInputs.throttle, level_ok ? "OK" : "BAD");
        }
    }
    // Disarm on falling edge
    if (armEdgeFalling && flightState.motors_armed)
    {
        flightState.motors_armed = false;
        flightState.mode = MODE_DISARMED;
        flightState.altitude_hold_active = false;
        Serial.println("🔒 DISARMED");
        digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
        digitalWrite(NAV_BACK_CENTER_WHITE, LOW);
    }

    // If not armed, nothing further
    if (!flightState.motors_armed)
        return;

    // Mode switch edge detection (supports in-flight switching)
    bool modeState = controlInputs.mode_switch;
    if (modeState != lastModeSwitch)
    {
        flightState.mode = modeState ? MODE_STABILIZE : MODE_MANUAL;
        Serial.printf("🛩 Flight Mode -> %s\n", flightState.mode == MODE_STABILIZE ? "STABILIZE" : "MANUAL");
        // Reset PIDs when enabling stabilize for clean integrators
        if (flightState.mode == MODE_STABILIZE)
        {
            rollPID.reset();
            pitchPID.reset();
            yawPID.reset();
        }
        lastModeSwitch = modeState;
    }

    // (Altitude hold activation remains disabled / placeholder to avoid unintentional engagement.)
}

// ================================
// UTILITY FUNCTIONS
// ================================

float mapFloat(float x, float in_min, float in_max, float out_min, float out_max)
{
    return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float constrainFloat(float value, float min_val, float max_val)
{
    if (value < min_val)
        return min_val;
    if (value > max_val)
        return max_val;
    return value;
}

void calibrateIMU()
{
    // Stub: Calibration removed from runtime. Use separate calibration sketch to determine offsets
    // and paste the values into the IMU_*_OFFSET constants above.
    Serial.println("IMU calibration skipped (using predefined constants).");
}

// Duplicate IMU offset constants removed here. Single authoritative definitions are near the top
// of the file under the comment: "// IMU calibration data - will be set during startup calibration".

// ================================
// WEB SERVER SETUP
// ================================

void setupWebServer()
{
    // Serve main dashboard
    server.on("/", HTTP_GET, []()
              {
        String html = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <title>ESP32 Drone Flight Controller</title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        body { font-family: Arial, sans-serif; margin: 20px; background: #f0f0; }
        .container { max-width: 1200px; margin: 0 auto; }
        .card { background: white; padding: 20px; margin: 10px 0; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); }
        .status { display: flex; flex-wrap: wrap; gap: 10px; }
        .status-item { padding: 10px; border-radius: 4px; color: white; min-width: 100px; text-align: center; }
        .status-armed { background: #4CAF50; }
        .status-disarmed { background: #f44336; }
        .status-manual { background: #ff9800; }
        .status-stabilize { background: #2196F3; }
        .controls { display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 20px; }
        .joystick { text-align: center; padding: 20px; }
        button { padding: 10px 20px; margin: 5px; border: none; border-radius: 4px; cursor: pointer; }
        .btn-primary { background: #2196F3; color: white; }
        .btn-danger { background: #f44336; color: white; }
        .btn-success { background: #4CAF50; color: white; }
        input[type="range"] { width: 100%; }
        .sensor-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(200px, 1fr)); gap: 15px; }
        .sensor-value { padding: 10px; background: #e3f2fd; border-radius: 4px; text-align: center; }
        .emergency { background: #f44336; color: white; font-weight: bold; padding: 15px; border-radius: 8px; }
    </style>
</head>
<body>
    <div class="container">
        <h1>ESP32 Drone Flight Controller</h1>
        
        <!-- Flight Status -->
        <div class="card">
            <h2>Flight Status</h2>
            <div class="status" id="flightStatus">
                <div class="status-item status-disarmed">DISARMED</div>
                <div class="status-item">Manual Mode</div>
            </div>
            <div id="emergencyAlert" style="display: none;" class="emergency">
                WARNING: EMERGENCY MODE ACTIVE - LANDING AUTOMATICALLY
            </div>
        </div>
        
        <!-- Control Interface -->
        <div class="card">
            <h2>Flight Controls</h2>
            <div class="controls">
                <div class="joystick">
                    <h3>Throttle</h3>
                    <input type="range" id="throttle" min="0" max="100" value="0" orient="vertical" oninput="updateControl()">
                    <span id="throttle_val">0%</span>
                </div>
                <div class="joystick">
                    <h3>Roll (Left/Right)</h3>
                    <input type="range" id="roll" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="roll_val">0</span>
                </div>
                <div class="joystick">
                    <h3>Pitch (Forward/Back)</h3>
                    <input type="range" id="pitch" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="pitch_val">0</span>
                </div>
                <div class="joystick">
                    <h3>Yaw (Rotate)</h3>
                    <input type="range" id="yaw" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="yaw_val">0</span>
                </div>
            </div>
            <div style="text-align: center; margin-top: 20px;">
                <button class="btn-success" onclick="armMotors()">ARM MOTORS</button>
                <button class="btn-danger" onclick="disarmMotors()">DISARM MOTORS</button>
                <button class="btn-primary" onclick="toggleFlightMode()">TOGGLE MODE</button>
                <button class="btn-danger" onclick="emergencyStop()">EMERGENCY STOP</button>
            </div>
        </div>
        
        <!-- Sensor Data -->
        <div class="card">
            <h2>Live Sensor Data</h2>
            <div class="sensor-grid" id="sensorData">
                <div class="sensor-value">Roll: 0.0 deg</div>
                <div class="sensor-value">Pitch: 0.0 deg</div>
                <div class="sensor-value">Altitude: 0.0 m</div>
                <div class="sensor-value">Battery: 0.0V</div>
            </div>
        </div>
        
