adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
        <!-- Motor Calibration -->
        <div class="card">
            <h2>Motor Calibration (Fix Imbalance)</h2>
            <p style="color: #666; font-size: 14px;">Adjust motor offsets to compensate for mechanical imbalances. Negative values reduce motor power.</p>
            <div class="controls">
                <div>
                    <h3>Motor 1 (Front Right CCW)</h3>
                    <label>Offset: <input type="number" id="motor1_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 2 (Back Right CW)</h3>
                    <label>Offset: <input type="number" id="motor2_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 3 (Front Left CW)</h3>
                    <label>Offset: <input type="number" id="motor3_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 4 (Back Left CCW)</h3>
                    <label>Offset: <input type="number" id="motor4_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
            </div>
            <div style="text-align: center; margin-top: 15px;">
                <button class="btn-primary" onclick="resetMotorCal()">Reset All to 0</button>
                <button class="btn-success" onclick="saveMotorCal()">Save Calibration</button>
            </div>
        </div>
        
        <!-- PID Tuning -->
        <div class="card">
            <h2>PID Tuning</h2>
            <div class="controls">
                <div>
                    <h3>Roll PID</h3>
                    <label>P: <input type="number" id="roll_p" value="0.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="roll_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="roll_d" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Pitch PID</h3>
                    <label>P: <input type="number" id="pitch_p" value="0.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="pitch_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="pitch_d" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Yaw PID</h3>
                    <label>P: <input type="number" id="yaw_p" value="0.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="yaw_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="yaw_d" value="0.00" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Altitude PID</h3>
                    <label>P: <input type="number" id="alt_p" value="0.00" step="0.05" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="alt_i" value="0.00" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="alt_d" value="0.00" step="0.05" onchange="updatePID()"></label><br>
                </div>
            </div>
                        <hr>
                        <h3>Mixer / Control Gains</h3>
                        <div class="controls">
                            <div>
                                <label>Mix KR (Roll): <input type="number" id="mix_kr" value="200" step="5" onchange="updatePID()"></label><br>
                                <label>Mix KP (Pitch): <input type="number" id="mix_kp" value="200" step="5" onchange="updatePID()"></label><br>
                                <label>Mix KY (Yaw): <input type="number" id="mix_ky" value="150" step="5" onchange="updatePID()"></label><br>
                            </div>
                            <div>
                                <label>Manual Axis Gain: <input type="number" id="manual_axis_gain" value="1.30" step="0.05" onchange="updatePID()"></label><br>
                                <label>Throttle Gate: <input type="number" id="throttle_gate" value="0.35" step="0.01" min="0" max="1" onchange="updatePID()"></label><br>
                                <label>Slew Roll/Pitch (deg/s): <input type="number" id="slew_rp" value="120" step="5" onchange="updatePID()"></label><br>
                                <label>Slew Yaw Rate (deg/s/s): <input type="number" id="slew_yaw" value="720" step="10" onchange="updatePID()"></label><br>
                                <label>Yaw Feed-Forward: <input type="number" id="yaw_ff" value="0.10" step="0.01" onchange="updatePID()"></label><br>
                                <label>Hover Throttle (µs): <input type="number" id="hover_thr" value="1550" step="5" onchange="updatePID()"></label><br>
                                <label>Integral Leak (0-0.05): <input type="number" id="i_leak" value="0.001" step="0.001" min="0" max="0.05" onchange="updatePID()"></label><br>
                            </div>
                        </div>
                        <hr>
                        <h3>Advanced: Fusion & Cascaded Control</h3>
                        <div class="controls">
                            <div>
                                <label><input type="checkbox" id="use_kalman"> Use Kalman for Roll/Pitch</label><br>
                                <label>Kalman Rate Std (deg/s): <input type="number" id="kalman_rate_std" value="4.0" step="0.5" onchange="updatePID()"></label><br>
                                <label>Kalman Meas Std (deg): <input type="number" id="kalman_meas_std" value="3.0" step="0.5" onchange="updatePID()"></label><br>
                            </div>
                            <div>
                                <label><input type="checkbox" id="use_cascaded"> Use Cascaded Angle→Rate</label><br>
                                <label>Max Roll/Pitch Rate (deg/s): <input type="number" id="max_rp_rate" value="180" step="10" onchange="updatePID()"></label><br>
                                <label>Rate Roll P: <input type="number" id="rate_roll_p" value="0.1" step="0.01" onchange="updatePID()"></label>
                                <label>I: <input type="number" id="rate_roll_i" value="0.02" step="0.01" onchange="updatePID()"></label>
                                <label>D: <input type="number" id="rate_roll_d" value="0.002" step="0.001" onchange="updatePID()"></label><br>
                                <label>Rate Pitch P: <input type="number" id="rate_pitch_p" value="0.1" step="0.01" onchange="updatePID()"></label>
                                <label>I: <input type="number" id="rate_pitch_i" value="0.02" step="0.01" onchange="updatePID()"></label>
                                <label>D: <input type="number" id="rate_pitch_d" value="0.002" step="0.001" onchange="updatePID()"></label>
                            </div>
                        </div>
        
