adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
        doc["pid"]["yaw_p"] = debugData.yaw_proportional;
        doc["pid"]["yaw_i"] = debugData.yaw_integral;
        doc["pid"]["yaw_d"] = debugData.yaw_derivative;
        doc["pid"]["yaw_sat"] = debugData.yaw_output_saturated;
        doc["pid"]["yaw_i_sat"] = debugData.yaw_integral_saturated;
        
        // Calibration Debug Section
        doc["calibration"]["active"] = debugData.imu_cal_active;
        doc["calibration"]["roll_offset"] = debugData.roll_cal_offset;
        doc["calibration"]["pitch_offset"] = debugData.pitch_cal_offset;
        
        // Motor Mix Section
        doc["motors"]["base_pwm"] = debugData.base_pwm;
        doc["motors"]["motor1"] = debugData.motor1_final;
        doc["motors"]["motor2"] = debugData.motor2_final;
        doc["motors"]["motor3"] = debugData.motor3_final;
        doc["motors"]["motor4"] = debugData.motor4_final;
        doc["motors"]["cal1"] = debugData.motor1_offset;
        doc["motors"]["cal2"] = debugData.motor2_offset;
        doc["motors"]["cal3"] = debugData.motor3_offset;
        doc["motors"]["cal4"] = debugData.motor4_offset;
        
        // Inputs Section
        doc["inputs"]["throttle"] = debugData.throttle_input;
        doc["inputs"]["roll"] = debugData.roll_input;
        doc["inputs"]["pitch"] = debugData.pitch_input;
        doc["inputs"]["yaw"] = debugData.yaw_input;
        
        // System Section
        doc["system"]["sensors_ok"] = debugData.sensors_ok;
        doc["system"]["emergency"] = debugData.emergency_active;
        doc["system"]["imu_calibrated"] = debugData.imu_calibrated;
        doc["system"]["uptime"] = debugData.uptime;
        doc["system"]["free_heap"] = debugData.free_heap;
        doc["system"]["timestamp"] = debugData.timestamp;
        
        String response;
        serializeJson(doc, response);
        server.send(200, "application/json", response); });

    server.begin();
    Serial.println("Web server started - Flight Controller Dashboard ready");
}

void initializeLEDs()
{
    pinMode(NAV_FRONT_RIGHT_GREEN, OUTPUT);
    pinMode(NAV_BACK_RIGHT_GREEN, OUTPUT);
    pinMode(NAV_BACK_LEFT_RED, OUTPUT);
    pinMode(NAV_FRONT_LEFT_RED, OUTPUT);
    pinMode(NAV_FRONT_CENTER_WHITE, OUTPUT);
    pinMode(NAV_BACK_CENTER_WHITE, OUTPUT);
    digitalWrite(NAV_FRONT_RIGHT_GREEN, LOW);
    digitalWrite(NAV_BACK_RIGHT_GREEN, LOW);
    digitalWrite(NAV_BACK_LEFT_RED, LOW);
    digitalWrite(NAV_FRONT_LEFT_RED, LOW);
    digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
    digitalWrite(NAV_BACK_CENTER_WHITE, LOW);
}

static unsigned long lastNavBlink = 0;
static bool navPhase = false;

void updateNavigationLights()
{
    unsigned long now = millis();
    // Blink at 2Hz when disarmed, solid when armed
    bool armed = flightState.motors_armed;
    if (!armed)
    {
        if (now - lastNavBlink >= 250)
        { // 4Hz toggle -> 2Hz full cycle
            navPhase = !navPhase;
            lastNavBlink = now;
        }
    }
    else
    {
        navPhase = true; // solid on while armed
    }
    // Red lights = left side orientation
    digitalWrite(NAV_FRONT_LEFT_RED, navPhase ? HIGH : LOW);
    digitalWrite(NAV_BACK_LEFT_RED, navPhase ? HIGH : LOW);
    // Green lights = right side orientation
    digitalWrite(NAV_FRONT_RIGHT_GREEN, navPhase ? HIGH : LOW);
    digitalWrite(NAV_BACK_RIGHT_GREEN, navPhase ? HIGH : LOW);
    // White strobes: front & back center strobe slower only when armed & stabilized
    static unsigned long lastStrobe = 0;
    static bool strobeOn = false;
    if (armed)
    {
        if (now - lastStrobe >= 1000)
        { // 1Hz strobe
            strobeOn = !strobeOn;
            lastStrobe = now;
        }
    }
    else
    {
        strobeOn = false;
    }
    digitalWrite(NAV_FRONT_CENTER_WHITE, strobeOn ? HIGH : LOW);
    digitalWrite(NAV_BACK_CENTER_WHITE, strobeOn ? HIGH : LOW);
}

static unsigned long lastStatusBlink = 0;
static bool statusPhase = false;

void updateStatusLights()
{
    // No-op: RGB status LEDs not present
}
